<center> <img src = https://raw.githubusercontent.com/AndreyRysistov/DatasetsForPandas/main/hh%20label.jpg alt="drawing" style="width:400px;">

# <center> Проект: Анализ вакансий из HeadHunter

In [1]:
import pandas as pd
import psycopg2

In [2]:
DBNAME = ****
USER = ****
PASSWORD = ****
HOST = ****
PORT = ****

In [3]:
connection = psycopg2.connect(
    dbname=DBNAME,
    user=USER,
    host=HOST,
    password=PASSWORD,
    port=PORT
)

In [2]:
# Есть несколько способов избежать отображения предупреждений при выполнении данной работы

# Вариант 1 игнорирование
import warnings
warnings.filterwarnings("ignore")

# Вариант 2 использование sqlalchemy как того просит pandas
from sqlalchemy import create_engine
# Параметры подключения к БД указаны в аргументах к create_engine, если будете использовать этот вариант после запуска ноутбука параметры желательно скрыть
connection = create_engine("postgresql+psycopg2://skillfactory:cCkxxLVrDE8EbvjueeMedPKt@84.201.134.129:5432/project_sql")
connection.connect()
# при этом варианте есть нюанс - везде где в коде встречается зна процентов, его нужно заменить на два знака процентов
# т.е. % -> %%

# Юнит 3. Предварительный анализ данных

1. Напишите запрос, который посчитает количество вакансий в нашей базе (вакансии находятся в таблице vacancies).

In [3]:
query_3_1 = f'''
select
    count(distinct id)
from
    vacancies
'''
df = pd.read_sql_query(query_3_1, connection)
df

   count
0  49197

Тут и далее, я бы советовал или использовать f-string или использовать ячейки типа marckdown для отображения текста, пример использования f-string привожу ниже:

In [6]:
print(f'Число уникальных id вакансий: {df.squeeze()}')

Число уникальных id вакансий: 49197

In [5]:
# 49197 - число уникальных id вакансий

2. Напишите запрос, который посчитает количество работодателей (таблица employers).

In [7]:
query_3_2 = f'''
select
    count(distinct id)
from
    employers
'''
df = pd.read_sql_query(query_3_2, connection)
df

   count
0  23501

In [7]:
# 23501 - количество уникальных id работодателей

3. Посчитате с помощью запроса количество регионов (таблица areas).

In [8]:
query_3_3 = f'''
select
    count(distinct id)
from
    areas
'''
df = pd.read_sql_query(query_3_3, connection)
df

   count
0   1362

In [9]:
# 1362 - количество уникальных id регионов

4. Посчитате с помощью запроса количество сфер деятельности в базе (таблица industries).

In [9]:
query_3_4 = f'''
select
    count(distinct id)
from
    industries
'''
df = pd.read_sql_query(query_3_4, connection)
df

   count
0    294

In [11]:
# 294 - количество уникальных id сфер деятельности

***

Для выводов обязательно использование ячеек типа markdown и очень желательно применять форматирование текста, что-то вроде:

## Выводы по юниту 3
* Предложений вакансий, в среднем, в 2 раза больше чем работодателей

* Множество вакансий из одних и тех же сфер деятельности, и тех же регионов

*тут кстати желательно подкрепить слова цифрами*

In [12]:
# Выводы:
# Предложений вакансий, в среднем, в 2 раза больше чем работодателей
# Множество вакансий из одних и тех же сфер деятельности, и тех же регионов

# Юнит 4. Детальный анализ вакансий

1. Напишите запрос, который позволит узнать, сколько (cnt) вакансий в каждом регионе (area).
Отсортируйте по количеству вакансий в порядке убывания.

In [10]:
# В юните 3 в запросах sql вы используете нижний регистр, тут верхний.
# Допускается использование как первого, так и второго НО не одновременно.
# Пожалуйста придерживайтесь принципов единообразия в коде, и разумеется 
# PEP 8 - стандарт индустрии, в любой непонятной ситуации обращайтесь к PEP 8)
query_4_1 = f'''
SELECT
    a.name as area,
    count(v.id) as cnt
FROM areas as a
JOIN vacancies as v ON a.id = v.area_id
GROUP BY 1
ORDER BY 2 desc
LIMIT 5
'''
df = pd.read_sql_query(query_4_1, connection)
df

              area   cnt
0           Москва  5333
1  Санкт-Петербург  2851
2            Минск  2112
3      Новосибирск  2006
4           Алматы  1892

In [14]:
# Пятерка лидеров по вакансиям: Москва, Санкт-Петербург, Минск, Новосибирск, Алматы

2. Напишите запрос, чтобы определить у какого количества вакансий заполнено хотя бы одно из двух полей с зарплатой.

In [11]:
query_4_2 = f'''
select
    count(*)
from vacancies v
WHERE (v.salary_from is not NULL) or (v.salary_to is not NULL)
'''
df = pd.read_sql_query(query_4_2, connection)
df

   count
0  24073

In [16]:
# Число вакансий с указанием зарплаты (24073) почти в два раза меньше от общего числа (49197)

3. Найдите средние значения для нижней и верхней границы зарплатной вилки. Округлите значения до целого.

In [12]:
query_4_3 = f'''
select
    round(AVG(salary_from)) lower_awg,
    round(AVG(salary_to)) upper_awg
from vacancies
'''
df = pd.read_sql_query(query_4_3, connection)
df

   lower_awg  upper_awg
0    71065.0   110537.0

In [18]:
# среднее значение нижней зарплатной вилки - 71065
# верхнее значение нижней зарплатной вилки - 110537

4. Напишите запрос, который выведет количество вакансий для каждого сочетания типа рабочего графика (schedule) и типа трудоустройства (employment), используемого в вакансиях. Результат отсортируйте по убыванию количества.

In [13]:
query_4_4 = f'''
select
    schedule,
    employment,
    count(*)
from vacancies
GROUP BY 1, 2
ORDER BY 3 desc
'''
df = pd.read_sql_query(query_4_4, connection)
df

            schedule           employment  count
0        Полный день     Полная занятость  35367
1   Удаленная работа     Полная занятость   7802
2      Гибкий график     Полная занятость   1593
3   Удаленная работа  Частичная занятость   1312
4     Сменный график     Полная занятость    940
5        Полный день           Стажировка    569
6     Вахтовый метод     Полная занятость    367
7        Полный день  Частичная занятость    347
8      Гибкий график  Частичная занятость    312
9        Полный день     Проектная работа    141
10  Удаленная работа     Проектная работа    133
11     Гибкий график           Стажировка    116
12    Сменный график  Частичная занятость    101
13  Удаленная работа           Стажировка     64
14     Гибкий график     Проектная работа     18
15    Сменный график           Стажировка     12
16    Вахтовый метод     Проектная работа      2
17    Сменный график     Проектная работа      1

In [20]:
# основная масса вакансий расчитаны на полный день и полную занятость: 35367
# гораздо меньше вакансий предлагают полную занятость, но удаленно: 7802

5. Напишите запрос, выводящий значения поля Требуемый опыт работы (experience) в порядке возрастания количества вакансий, в которых указан данный вариант опыта.

In [14]:
query_4_5 = f'''
select
    experience,
    count(*)
from vacancies
GROUP BY 1
ORDER BY 2
'''
df = pd.read_sql_query(query_4_5, connection)
df

           experience  count
0         Более 6 лет   1337
1           Нет опыта   7197
2       От 3 до 6 лет  14511
3  От 1 года до 3 лет  26152

In [22]:
# Основаная масса работодателей ищет сотрудника со стажем от 1 до 3 лет. 
# Вакансии с требуемым опытом более 6 лет встречаются всех реже.

***

In [23]:
# Самая распространенная вакансия: опыть работы от 1 до 3 лет, полный день и полная занятость, с ЗП от 71 до 110тыс.р, г. Москва.

# Юнит 5. Анализ работодателей

1. Напишите запрос, который позволит узнать, какие работодатели находятся на первом и пятом месте по количеству вакансий.

In [15]:
query_5_1 = f'''
select
    e.name,
    count(*)
from vacancies v
JOIN employers e ON e.id = employer_id
GROUP BY 1
ORDER BY count(*) desc
LIMIT 5
'''
df = pd.read_sql_query(query_5_1, connection)
df

            name  count
0         Яндекс   1933
1     Ростелеком    491
2       Тинькофф    444
3           СБЕР    428
4  Газпром нефть    331

In [25]:
# 1 место по вакансиям - Яндекс
# 5 место по вакансиям - Газпром нефть

2. Напишите запрос, который для каждого региона выведет количество работодателей и вакансий в нём.
Среди регионов, в которых нет вакансий, найдите тот, в котором наибольшее количество работодателей.

In [16]:
query_5_2 = f'''
select
    a.name region_name,
    count(distinct e.id) count_employers,
    count(distinct v.id) count_vacancies
from areas a
left join employers e on a.id = e.area
left join vacancies v on v.area_id = a.id
where v.id is null
GROUP BY 1
ORDER BY 2 desc
'''
df = pd.read_sql_query(query_5_2, connection)
df

                        region_name  count_employers  count_vacancies
0                            Россия              410                0
1                         Казахстан              207                0
2                Московская область               75                0
3                Краснодарский край               19                0
4                          Беларусь               18                0
..                              ...              ...              ...
588                        Кувандык                0                0
589                        Куйбышев                0                0
590  Куйбышево (Ростовская область)                0                0
591                        Култаево                0                0
592                        Кульсары                0                0

[593 rows x 3 columns]

In [27]:
# Наибольший регион без вакансий  - Россия

3. Для каждого работодателя посчитайте количество регионов, в которых он публикует свои вакансии. Отсортируйте результат по убыванию количества.

In [17]:
query_5_3 = f'''
select
    e.name,
    count(distinct v.area_id)
from employers e
left join vacancies v on v.employer_id = e.id
GROUP BY 1
ORDER BY 2 desc
'''
df = pd.read_sql_query(query_5_3, connection)
df

                         name  count
0                      Яндекс    181
1                  Ростелеком    152
2                  Спецремонт    116
3      Поляков Денис Иванович     88
4                   ООО ЕФИН      71
...                       ...    ...
23170                  СДЕЛКА      0
23171            Alandr Group      0
23172                     СДК      0
23173      Lemon Land Lombard      0
23174                  Махина      0

[23175 rows x 2 columns]

In [29]:
# Наибольшее количество регионов по вакансиям охватывает Яндекс с 181 вакансиями.

4. Напишите запрос для подсчёта количества работодателей, у которых не указана сфера деятельности.

In [18]:
query_5_4 = f'''
select
    count(*)
from employers e
left join employers_industries ei on e.id = ei.employer_id
WHERE industry_id is null
'''
df = pd.read_sql_query(query_5_4, connection)
df

   count
0   8419

In [31]:
# 8419 компаний не указали сферу деятельности

5. Напишите запрос, чтобы узнать название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, у которых указано четыре сферы деятельности.

In [19]:
query_5_5 = f'''
select
    e.name,
    count(industry_id)
from employers e
left join employers_industries ei on e.id = ei.employer_id
GROUP BY 1
HAVING count(industry_id) = 4
ORDER BY 1 
LIMIT 3
'''
df = pd.read_sql_query(query_5_5, connection)
df

           name  count
0  101 Интернет      4
1      21vek.by      4
2          2ГИС      4

In [33]:
# Название компании, находящейся на третьем месте в алфавитном списке (по названию) компаний, 
# у которой указано четыре сферы деятельности - 2ГИС

6. С помощью запроса выясните, у какого количества работодателей в качестве сферы деятельности указана Разработка программного обеспечения.

In [21]:
# тут заменил % на %%
query_5_6 = f'''
select
    count(distinct e.id)
from employers e
LEFT JOIN employers_industries ei ON ei.employer_id = e.id
LEFT JOIN industries i ON i.id = ei.industry_id
WHERE LOWER(i.name) LIKE '%%разраб%%програм%%обесп%%'
'''
df = pd.read_sql_query(query_5_6, connection)
df

   count
0   3553

In [35]:
# У 3553 работодателей в качестве сферы деятельности указана разработка ПО

7. Для компании «Яндекс» выведите список регионов-миллионников, в которых представлены вакансии компании, вместе с количеством вакансий в этих регионах. Также добавьте строку Total с общим количеством вакансий компании. Результат отсортируйте по возрастанию количества.

Список городов-милионников надо взять [отсюда](https://ru.wikipedia.org/wiki/%D0%93%D0%BE%D1%80%D0%BE%D0%B4%D0%B0-%D0%BC%D0%B8%D0%BB%D0%BB%D0%B8%D0%BE%D0%BD%D0%B5%D1%80%D1%8B_%D0%A0%D0%BE%D1%81%D1%81%D0%B8%D0%B8). 

Если возникнут трудности с этим задание посмотрите материалы модуля  PYTHON-17. Как получать данные из веб-источников и API.

In [22]:
import urllib.parse as req 
path_common = req.urlparse('https://ru.wikipedia.org/wiki/Города-миллионеры_России#Список_городов-миллионеров') 
url = path_common.scheme + '://' + req.quote(path_common.netloc) + req.quote(path_common.path) + '#'+ req.quote(path_common.fragment) 
dff = pd.read_html(url)[1]
url

cities = tuple(dff['Город'].tolist())
display(cities)

('Москва',
 'Санкт-Петербург',
 'Новосибирск',
 'Екатеринбург',
 'Казань',
 'Нижний Новгород',
 'Красноярск',
 'Челябинск',
 'Самара',
 'Уфа',
 'Ростов-на-Дону',
 'Краснодар',
 'Омск',
 'Воронеж',
 'Пермь',
 'Волгоград')

In [23]:
query_5_7 = f'''
                with ts as (
                    SELECT 
                        a.name, 
                        COUNT(v.id) cnt
                    FROM vacancies v
                    JOIN employers e ON v.employer_id = e.id
                    JOIN areas a ON a.id = v.area_id
                    WHERE e.name = 'Яндекс' and a.name in {cities}
                    GROUP BY a.name
                    ORDER BY cnt
                )
                SELECT 
                    ts.name,
                    ts.cnt
                FROM ts
                UNION ALL
                SELECT 'total', SUM(ts.cnt)
                FROM ts
'''

df = pd.read_sql_query(query_5_7, connection)
df

               name    cnt
0              Омск   21.0
1         Челябинск   22.0
2        Красноярск   23.0
3         Волгоград   24.0
4             Пермь   25.0
5            Казань   25.0
6    Ростов-на-Дону   25.0
7               Уфа   26.0
8            Самара   26.0
9         Краснодар   30.0
10          Воронеж   32.0
11      Новосибирск   35.0
12  Нижний Новгород   36.0
13     Екатеринбург   39.0
14  Санкт-Петербург   42.0
15           Москва   54.0
16            total  485.0

In [38]:
#Наибольшее число вакансий для Яндекс суммарно находятся в г. Москва, меньше всего вакансий в г. Омск. Суммарно вакансий компании: 485.

***

In [39]:
#Наиболее крупной компанией по размещению вакансий является Яндекс: 1933 вакансии  
#Больше всего вакансий размещено в городах-миллионниках, и, более всего, в г. Москва и г. Санкт-Петербург
#На разработку ПО приходится 3553 вакансии
#Число работодателей без указания сферы деятельности - 8419

# Юнит 6. Предметный анализ

1. Сколько вакансий имеет отношение к данным?

Считаем, что вакансия имеет отношение к данным, если в её названии содержатся слова 'data' или 'данн'.

*Подсказка: Обратите внимание, что названия вакансий могут быть написаны в любом регистре.*

In [25]:
# тут заменил % на %% для проверки работоспособности, далее менять не стал.
query_6_1 = f'''
select
    count(v.id)
from vacancies v
WHERE LOWER(v.name) LIKE '%%data%%' or LOWER(v.name) LIKE '%%данн%%'
'''
df = pd.read_sql_query(query_6_1, connection)
df

   count
0   1771

In [41]:
#Число вакансий по работе с данными: 1771

2. Сколько есть подходящих вакансий для начинающего дата-сайентиста? 
Будем считать вакансиями для дата-сайентистов такие, в названии которых есть хотя бы одно из следующих сочетаний:
* 'data scientist'
* 'data science'
* 'исследователь данных'
* 'ML' (здесь не нужно брать вакансии по HTML)
* 'machine learning'
* 'машинн%обучен%'

** В следующих заданиях мы продолжим работать с вакансиями по этому условию.*

Считаем вакансиями для специалистов уровня Junior следующие:
* в названии есть слово 'junior' *или*
* требуемый опыт — Нет опыта *или*
* тип трудоустройства — Стажировка.

In [42]:
query_6_2 = f'''
select
    count(v.id)
from vacancies v
WHERE
    (
    name ILIKE '%data scientist%' 
    OR name ILIKE '%data science%' 
    OR name ILIKE '%исследователь данных%'
    OR (name ILIKE '%ML%' AND name NOT ILIKE '%HTML%')
    OR name ILIKE '%machine learning%'
    OR name ILIKE '%машинн%обучен%'
    AND key_skills IS NOT NULL
    )
    AND (v.name ILIKE '%junior%'
    OR v.experience ILIKE '%Нет опыта%'
    OR v.employment ILIKE '%Стажировка%')
'''
df = pd.read_sql_query(query_6_2, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\2727739841.py:19: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_2, connection)

   count
0     51

In [43]:
# имеются вакансии Junior в количестве 51

3. Сколько есть вакансий для DS, в которых в качестве ключевого навыка указан SQL или postgres?

** Критерии для отнесения вакансии к DS указаны в предыдущем задании.*

In [44]:
query_6_3 = f'''
select
    count(v.id)
from vacancies v
where 
    (
    name ILIKE '%data scientist%' 
    OR name ILIKE '%data science%' 
    OR name ILIKE '%исследователь данных%'
    OR (name ILIKE '%ML%' AND name NOT ILIKE '%HTML%')
    OR name ILIKE '%machine learning%'
    OR name ILIKE '%машинн%обучен%'
    AND key_skills IS NOT NULL
    )
    AND
    (
    v.key_skills ilike '%SQL%' 
    or v.key_skills ilike '%postgres%'
    )
'''
df = pd.read_sql_query(query_6_3, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\3029562288.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_3, connection)

   count
0    229

In [45]:
#ключевой SQl или postgress требуются в 229 вакансиях

4. Проверьте, насколько популярен Python в требованиях работодателей к DS.Для этого вычислите количество вакансий, в которых в качестве ключевого навыка указан Python.

** Это можно сделать помощью запроса, аналогичного предыдущему.*

In [46]:
query_6_4 = f'''
select
    count(*)
from vacancies v
WHERE
    ((name ILIKE '%data scientist%') OR (name ILIKE '%data science%') OR (name ILIKE '%исследователь данных%')
    OR ((name ILIKE '%ML%')
    AND (name NOT ILIKE '%HTML%'))
    OR (name ILIKE '%machine learning%')
    OR (name ILIKE '%машинн%обучен%')
    AND 
    (key_skills IS NOT NULL))
    AND
    (
    v.key_skills ilike '%Python%' 
    )
'''
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\2030784353.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0    357

In [47]:
#ключевой Python требуется в 357 вакансиях

5. Сколько ключевых навыков в среднем указывают в вакансиях для DS?
Ответ округлите до двух знаков после точки-разделителя.

In [48]:
query_6_5 = f'''
select
    round(avg(length(key_skills)-length(replace(key_skills, CHR(9), ''))+1), 2)
from vacancies v
WHERE
    ((v.name ILIKE '%data scientist%') OR (v.name ILIKE '%data science%') OR (v.name ILIKE '%исследователь данных%')
    OR ((v.name LIKE '%ML%')
    AND (v.name NOT ILIKE '%HTML%'))
    OR (v.name ILIKE '%machine learning%')
    OR (v.name ILIKE '%машинн%обучен%')
    AND 
    v.key_skills IS NOT NULL
    )
'''
df = pd.read_sql_query(query_6_5, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\2015847220.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_5, connection)

   round
0   6.41

In [49]:
# В среднем рассматривают 6.41 ключевых навыка

6. Напишите запрос, позволяющий вычислить, какую зарплату для DS в **среднем** указывают для каждого типа требуемого опыта (уникальное значение из поля *experience*). 

При решении задачи примите во внимание следующее:
1. Рассматриваем только вакансии, у которых заполнено хотя бы одно из двух полей с зарплатой.
2. Если заполнены оба поля с зарплатой, то считаем зарплату по каждой вакансии как сумму двух полей, делённую на 2. Если заполнено только одно из полей, то его и считаем зарплатой по вакансии.
3. Если в расчётах участвует null, в результате он тоже даст null (посмотрите, что возвращает запрос select 1 + null). Чтобы избежать этой ситуацию, мы воспользуемся функцией [coalesce](https://postgrespro.ru/docs/postgresql/9.5/functions-conditional#functions-coalesce-nvl-ifnull), которая заменит null на значение, которое мы передадим. Например, посмотрите, что возвращает запрос `select 1 + coalesce(null, 0)`

Выясните, на какую зарплату в среднем может рассчитывать дата-сайентист с опытом работы от 3 до 6 лет. Результат округлите до целого числа.

In [50]:
query_6_6 = f'''
SELECT 
    v.experience experience, 
    round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to))) 
FROM 
    vacancies v
WHERE
    ((v.name ILIKE '%data scientist%') OR (v.name ILIKE '%data science%') OR (v.name ILIKE '%исследователь данных%')
    OR ((v.name LIKE '%ML%')
    AND (v.name NOT ILIKE '%HTML%'))
    OR (v.name ILIKE '%machine learning%')
    OR (v.name ILIKE '%машинн%обучен%')
    AND 
    v.key_skills IS NOT NULL
    )
GROUP BY 1
'''
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\2834367822.py:18: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience     round
0         Более 6 лет       NaN
1           Нет опыта   74643.0
2  От 1 года до 3 лет  145236.0
3       От 3 до 6 лет  243115.0

In [51]:
#Сеньер ds может расчитывать на сумму порядка 243тыс.р

***

In [52]:
#Junior ds специалисты, как правило, не востребованы
#число ds вакансий 1771 
#SQL, postgress, Puthon - одни из ключевых навыков в профессии ds
#Зарплата новичка меньше ЗП сеньера более чем в 3 раза

# Общий вывод по проекту

# Важно! 
## Можно и нужно делать комментарии к коду или "пометки на полях", но подавать массив информации в виде комментариев, используя ячейки типа code -0 очень плохая идея. Пожалуйста не делайте так.

In [53]:
#Основная масса вакансий расчитаны на полный день и полную занятость для Мидл - специалиста.
#В Москве и С.-Петербурге самое больше число вакансий.
#1C разработчиков требуется достаточно много: более 5500
#Python разработчиков требуется более 3400
#Специалистов по аналитике требуется достаточно много: более 3300
#C++ / C# разработчиков требуется более 2700
#Специалистов по администрированию требуется более 2500
#DS разработчиков требуется более 1700

#Средняя ЗП сеньера 1С 128029р в 2 раза ниже ЗП сеньера DS.
#619 вакансий по Москве для DS. В столице основной спрос на таких специалистов.

In [26]:
query_3_1 = f'''
select
    v.name, v.key_skills
from
    vacancies v
LIMIT 50
'''
df = pd.read_sql_query(query_3_1, connection)
df

,name,key_skills
0,Компьютерный Мастер,Пользователь ПК\tРабота в команде\tРемонт ноут...
1,Системный администратор,Средства криптографической защиты информации\t...
2,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit
3,Lead Java Developer to Poland,Spring Framework\tSQL\tHibernate ORM\tJava\tGit
4,Специалист службы поддержки с техническими зна...,None
5,Корректор,Корректура текстов\tГрамотность\tРабота в кома...
6,React Front-end Middle Developer,JavaScript\tTypeScript\tCSS3\tNode.js\tHTML5
7,Инженер-программист,Java SE\tSpring Framework\tSpring Boot\tGit\tS...
8,Системный администратор,Linux\tАдминистрирование сетевого оборудования...
9,Ведущий специалист группы разработки систем,1С программирование\t1С: Предприятие 8\t1С: До...
10,Ведущий программист 1C,PostgreSQL\tSQL\tLinux\t1С программирование\tM...
11,Senior Android Developer,Android\tJava\tAndroid SDK\tKotlin\tООП
12,"Senior DevOps Engineer (AWS), Investment Manag...",Git\tAWS\tLinux\tProject management\tSCALA
13,Системный администратор,None
14,Product manager,Управление проектами\tProject management\tHTML...
15,Начальник отдела информационной безопасности,Информационная безопасность\tАудит безопасност...
16,Специалист технической поддержки 1С Розница,1С: Розница\tПользователь ПК\tНастройка ПК\tНа...
17,Главный инженер по сопровождению сервисов (2 л...,Linux\tKubernetes\tZabbix\tDocker\tNginx
18,Старший менеджер по сопровождению сделок Отдел...,Пользователь ПК\tРабота с большим объемом инфо...
19,Сотрудник службы поддержки с техническими знан...,None
20,Team lead / Senior backend developer,JavaScript\tPython\tDjango Framework\tLinux\tC...
21,Senior Flutter developer,Git\tАнглийский язык\tFlutter\tДеловое общение...
22,Инженер технической поддержки (удаленная работа),Работа в команде\tТелекоммуникации\tКомпетентн...
23,Руководитель внедрения IT-проектов (Дальний Во...,None
24,Менеджер по продукту,Работа в команде\tРазработка технических задан...
25,Инженер автохозяйства,Первичная документация\tУчет материалов\tПольз...
26,Android developer (IoT),Kotlin\tAndroid
27,Ночной Специалист службы технической поддержки,входящие звонки\tПользователь ПК\tГрамотная ре...
28,Project Manager (Kingdom Clash),None
29,Программист-разработчик JavaScript (middle Jav...,None
30,Менеджер проектов,Деловое общение\tНавыки презентации\tПользоват...
31,Разработчик 1С,None
32,Системный администратор,Windows 7\tOSI\tРегистрация\tMS Windows\tСвязь...
33,Программист 1С,1С программирование\t1С: Предприятие 8\t1С: Уп...
34,Системный администратор,Настройка ПК\tНастройка ПО\tРабота в команде\t...
35,C++ Developer,Английский язык\tC/C++\tMathematical Modeling
36,Инженер объединенного эксплуатационного центра,Linux\tИнформационные технологии\tMS SQL\tOrac...
37,Специалист по статистике хоккейных матчей,Статистика\tInternet\tУсидчивость\tРабота в ко...
38,Аналитик отдела продаж,Работа с большим объемом информации\tMS PowerP...
39,Middle/Senior Front End Разработчик,JavaScript\tjQuery\tBootstrap\tCSS\tHTML
40,QA engineer (Web),Проведение тестирований\tРегрессионное тестиро...
41,Аналитик,Power BI\tАнглийский язык\tАнализ данных\tУпра...
42,Разработчик видеоигр (Unity разработчик),Unity\tC#\tАнглийский язык\tООП\tScrum
43,Инженер технической поддержки,None
44,Инженер отдела технической поддержки,None
45,Руководитель отдела дизайна,Креативность\tAdobe Illustrator\tAdobe Photosh...
46,Главный специалист отдела информационной безоп...,Поиск информации в интернет\tInternet\tУмение ...
47,Главный специалист отдела информационной безоп...,Поиск информации в интернет\tInternet\tУмение ...
48,CDO / Директор цифровых ИТ проектов / ИТ Директор,Ведение переговоров\tРуководство коллективом\t...
49,Инженер-программист,1С программирование\t1С: Предприятие 8\t1С: За...

In [27]:
query_3_1 = f'''
select
    v.name,
    v.key_skills
from
    vacancies v
WHERE (v.key_skills ILIKE '%1C%' or v.key_skills ILIKE '%1С%' or v.name ILIKE '%1C%') AND v.key_skills is not NULL
ORDER BY 1 desc
'''
df = pd.read_sql_query(query_3_1, connection)
df

TypeError: dict is not a sequence

In [56]:
query_3_1 = f'''
select
    v.name, v.key_skills
from
    vacancies v
WHERE v.key_skills ILIKE '%C++%' or v.key_skills ILIKE '%C#%' or v.name ILIKE '%C++%' or v.name ILIKE '%C#%'
'''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\2794855976.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

,name,key_skills
0,C++ Developer,Английский язык\tC/C++\tMathematical Modeling
1,Разработчик видеоигр (Unity разработчик),Unity\tC#\tАнглийский язык\tООП\tScrum
2,Разработчик Fullstack,C#\t.NET Core\tJavaScript\tRESTful\tHTTP\tАсин...
3,Rust engineer,Git\tРабота с базами данных\tTDD\tBlockchain\t...
4,Программист группы развития информационных систем,Oracle Pl/SQL\tSQL\tC#\t.NET Framework\tJava
...,...,...
2703,C++ / C# Developer,Scrum\tC++\tC#\tGit\tAzure
2704,Программист беспроводных сенсорных сетей,C/C++\tSTM32\tООП\tC#
2705,Инженер-программист (разработчик),C#\tООП\tGit\tPHP\tSQL
2706,Разработчик SahrePoint,MS SharePoint\tC#\tCSS\tHTML\tJavaScript\tMS SQL
2707,C++ developer in Visualization,C++\tVisualization\tOpenGL\tGLSL\tVulkan

In [57]:
query_3_1 = f'''
select
    v.name, v.key_skills
from
    vacancies v
WHERE v.key_skills ILIKE '%Администр%'
'''
df = pd.read_sql_query(query_3_1, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\3473205268.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_3_1, connection)

,name,key_skills
0,Системный администратор,Linux\tАдминистрирование сетевого оборудования...
1,Инженер объединенного эксплуатационного центра,Linux\tИнформационные технологии\tMS SQL\tOrac...
2,Системный администратор,Active Directory\tАдминистрирование сетевого о...
3,"Комьюнити-менеджер/Администратор чата, каналов...",Грамотная речь\tРабота в команде\tГрамотность\...
4,Специалист технической поддержки,Администрирование\tHelpdesk\tНастройка ПО\tТех...
...,...,...
2521,Менеджер проекта,Деловой этикет\tМногозадачность\tДеловая комму...
2522,Специалист технической поддержки,Настройка DNS\tWindows 7\tTCP/IP\tWindows Xp\t...
2523,Системный администратор,Сборка ПК\tАдминистрирование серверов Windows\...
2524,Главный специалист отдела информационных техно...,Настройка сетевых подключений\tНастройка ПО\tР...
2525,Начальник отдела информационных технологий,Ответственное хранение\tТехническая документац...

In [58]:
query_6_6 = f'''
SELECT 
    v.experience experience, 
    round(avg(coalesce((salary_from+salary_to)/2, salary_from, salary_to))) 
    
FROM 
    vacancies v
WHERE
    v.name ILIKE '%1c%' OR v.name ILIKE '%1C%' and
    v.key_skills IS NOT NULL
    
GROUP BY 1
'''
df = pd.read_sql_query(query_6_6, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\3545839803.py:14: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_6, connection)

           experience     round
0         Более 6 лет  171429.0
1           Нет опыта   45828.0
2       От 3 до 6 лет  128029.0
3  От 1 года до 3 лет   90582.0

In [59]:
query_6_4 = f'''
select
    count(*)
from vacancies v
WHERE
    v.key_skills ilike '%Python%' 
    
'''
df = pd.read_sql_query(query_6_4, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\2534486745.py:9: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_4, connection)

   count
0   3461

In [60]:
query_6_1 = f'''
with ts as (
                    SELECT 
                        a.name, 
                        COUNT(v.id) cnt
                    FROM vacancies v
                    JOIN employers e ON v.employer_id = e.id
                    JOIN areas a ON a.id = v.area_id
                    WHERE LOWER(v.name) LIKE '%data%' or LOWER(v.name) LIKE '%данн%' and a.name in {cities}
                    GROUP BY a.name
                    ORDER BY 2 desc
                )
                SELECT 
                    ts.name,
                    ts.cnt
                FROM ts
                UNION ALL
                SELECT 'total', SUM(ts.cnt)
                FROM ts
'''
df = pd.read_sql_query(query_6_1, connection)
df

C:\Users\Jacky\AppData\Local\Temp\ipykernel_3740\1153331386.py:21: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query_6_1, connection)

                            name     cnt
0                         Москва   619.0
1                Санкт-Петербург   164.0
2                         Алматы    78.0
3                          Минск    72.0
4                    Новосибирск    57.0
..                           ...     ...
64                  Петрозаводск     1.0
65                      Кемерово     1.0
66                   Калининград     1.0
67  Ростов (Ярославская область)     1.0
68                         total  1502.0

[69 rows x 2 columns]